[
  {
    "id": "1",
    "text": "Banana is a tropical fruit with a bright yellow peel when ripe, known for its soft, creamy texture and naturally sweet flavor. It is an excellent source of potassium, vitamin B6, and dietary fiber, making it a perfect pre or post-workout snack. Bananas can be eaten fresh, blended into smoothies, sliced over cereal, or used in baking for moist banana bread. They are one of the most widely consumed fruits globally and are available year-round.",
    "region": "Tropical",
    "type": "Fruit",
    "dietary": ["Vegan", "Gluten-Free", "Dairy-Free"],
    "nutritional_highlights": "High in potassium, vitamin B6, fiber, natural sugars for energy",
    "preparation": "Eaten raw, blended, baked, or frozen for smoothies"
  },
  {
    "id": "2",
    "text": "Lemon is a citrus fruit known for its bright yellow color and intensely sour, tangy flavor due to its high citric acid content. It is an excellent source of vitamin C, antioxidants, and flavonoids that support immune health and digestion. Lemons are used in cooking, baking, beverages like lemonade, and as a natural cleaning agent. The zest adds aromatic flavor to dishes, while the juice is used in dressings, marinades, and desserts.",
    "region": "Mediterranean, Tropical",
    "type": "Fruit",
    "dietary": ["Vegan", "Gluten-Free", "Dairy-Free", "Keto-Friendly"],
    "nutritional_highlights": "Very high in vitamin C, citric acid, antioxidants, low calories",
    "preparation": "Juiced, zested, sliced for garnish, used in marinades and dressings"
  },
  {
    "id": "3",
    "text": "Chili pepper is a spicy fruit from the Capsicum genus, known for its fiery heat caused by capsaicin. Available in varieties from mild jalapeño to extremely hot ghost peppers, chilies are used worldwide to add heat and depth to dishes. They contain vitamin C, vitamin A, and capsaicin which may boost metabolism and reduce inflammation. Chilies can be used fresh, dried, powdered, or fermented into hot sauces.",
    "region": "Mexico, South America, Asia",
    "type": "Spice",
    "dietary": ["Vegan", "Gluten-Free", "Keto-Friendly"],
    "nutritional_highlights": "High in vitamin C, vitamin A, capsaicin for metabolism boost",
    "preparation": "Fresh in salsas, dried and ground, pickled, or made into hot sauce"
  },
  {
    "id": "4",
    "text": "Apple is one of the world's most popular fruits, available in varieties ranging from sweet Fuji to tart Granny Smith. Apples are rich in dietary fiber, vitamin C, and polyphenol antioxidants that support heart health and gut bacteria. The saying 'an apple a day keeps the doctor away' reflects its health benefits. Apples can be eaten raw, baked into pies, made into cider or sauce, or sliced with nut butter for a healthy snack.",
    "region": "Global, originated Central Asia",
    "type": "Fruit",
    "dietary": ["Vegan", "Gluten-Free", "Dairy-Free"],
    "nutritional_highlights": "High in fiber, vitamin C, antioxidants, supports heart health",
    "preparation": "Eaten raw, baked, juiced, made into cider, sauce, or pie"
  },
  {
    "id": "5",
    "text": "Biryani is a legendary aromatic rice dish from the Indian subcontinent, featuring basmati rice layered with marinated meat (chicken, lamb, or goat) or vegetables, slow-cooked with saffron, ghee, and a complex blend of spices including cardamom, cinnamon, bay leaves, and star anise. The dish is traditionally sealed with dough (dum cooking) to trap steam and infuse flavors. Each region has its signature style - Hyderabadi biryani is known for its spiciness, Lucknowi for its subtle flavors, and Kolkata biryani includes potatoes. It's often served with raita and mirchi ka salan.",
    "region": "Hyderabad, Lucknow, India",
    "type": "Main Course",
    "dietary": ["Gluten-Free", "Contains Dairy"],
    "nutritional_highlights": "High in protein, carbohydrates, contains healthy spices with anti-inflammatory properties",
    "preparation": "Layered rice and meat slow-cooked in sealed pot (dum style), 2-3 hours"
  },
  {
    "id": "6",
    "text": "Samosa is an iconic triangular fried or baked pastry originating from the Indian subcontinent, featuring a crispy golden outer shell made from maida flour filled with spiced mashed potatoes, green peas, and aromatic spices like cumin, coriander, and garam masala. Some variations include minced meat (keema samosa). The pastry is deep-fried until golden and crispy, then served hot with mint chutney and tamarind sauce. Samosas are popular street food, tea-time snacks, and party appetizers across South Asia, Middle East, and Africa.",
    "region": "North India, originated Middle East",
    "type": "Snack",
    "dietary": ["Vegetarian (potato version)", "Contains Gluten"],
    "nutritional_highlights": "Good source of carbohydrates, potassium from potatoes, protein in meat versions",
    "preparation": "Dough wrapped around spiced filling, deep-fried until golden, 15-20 minutes"
  },
  {
    "id": "7",
    "text": "Paneer Butter Masala (also called Paneer Makhani) is a rich, creamy North Indian curry featuring cubes of fresh paneer (Indian cottage cheese) simmered in a velvety tomato-based gravy with butter, cream, and aromatic spices. The sauce is made by blending roasted tomatoes, cashews, and spices like garam masala, kasuri methi, and cardamom. This vegetarian dish is a restaurant favorite worldwide, known for its mild heat and indulgent texture. It's best served with naan, roti, or jeera rice.",
    "region": "Punjab, North India",
    "type": "Main Course",
    "dietary": ["Vegetarian", "Gluten-Free", "High Protein"],
    "nutritional_highlights": "High in protein and calcium from paneer, healthy fats, lycopene from tomatoes",
    "preparation": "Paneer cubes cooked in creamy tomato gravy with butter and spices, 30 minutes"
  },
  {
    "id": "8",
    "text": "Masala Dosa is a beloved South Indian breakfast consisting of a large, thin, crispy crepe made from fermented rice and urad dal batter, filled with spiced mashed potato (aloo masala) seasoned with mustard seeds, curry leaves, turmeric, and green chilies. The fermentation process gives the dosa its distinctive tangy flavor and makes it easier to digest while adding probiotics. Served with coconut chutney and sambar (lentil vegetable stew), masala dosa is a complete, nutritious meal that's naturally gluten-free and vegan.",
    "region": "Karnataka, South India",
    "type": "Breakfast",
    "dietary": ["Vegan", "Gluten-Free", "Probiotic"],
    "nutritional_highlights": "Fermented food with probiotics, good protein from lentils, complex carbohydrates",
    "preparation": "Fermented batter spread thin on griddle, filled with potato masala, served with chutney"
  },
  {
    "id": "9",
    "text": "Chole (Chana Masala) is a hearty North Indian chickpea curry cooked in a spiced onion-tomato gravy with a signature dark color from tea leaves or black cardamom. The dish features tender chickpeas simmered with chole masala (a special spice blend), ginger, garlic, and aromatics until rich and flavorful. Chole is traditionally paired with bhature (deep-fried bread) as Chole Bhature, or served with rice, roti, or kulcha. It's a protein-rich vegetarian staple that's popular for breakfast and lunch across North India.",
    "region": "Punjab, North India",
    "type": "Main Course",
    "dietary": ["Vegan", "Gluten-Free", "High Protein", "High Fiber"],
    "nutritional_highlights": "Excellent plant protein, high fiber, iron, folate, and complex carbohydrates",
    "preparation": "Chickpeas pressure-cooked then simmered in spiced tomato gravy, 45 minutes"
  },
  {
    "id": "10",
    "text": "Rasgulla is a beloved Bengali dessert consisting of soft, spongy balls made from fresh chhena (Indian cottage cheese) and semolina, cooked in light sugar syrup flavored with cardamom and rose water. The balls are incredibly light and absorb the sweet syrup, creating a melt-in-your-mouth texture. Originating from Odisha and Bengal, rasgulla is served chilled as a refreshing dessert, especially during festivals like Durga Puja. The key to perfect rasgulla is properly kneading the chhena until smooth and cooking in syrup until doubled in size.",
    "region": "Bengal, Odisha, India",
    "type": "Dessert",
    "dietary": ["Vegetarian", "Gluten-Free option available"],
    "nutritional_highlights": "Good source of calcium and protein from chhena, moderate sugar content",
    "preparation": "Chhena balls boiled in sugar syrup for 15-20 minutes until spongy and doubled"
  },
  {
    "id": "11",
    "text": "Naan is a soft, fluffy, and slightly chewy leavened flatbread that is a staple of Indian cuisine. Made from white flour, yogurt, yeast, and sometimes milk, the dough is traditionally slapped onto the walls of a super-hot tandoor (clay oven) where it puffs up and develops characteristic charred spots. Popular variations include garlic naan, butter naan, keema naan (stuffed with spiced meat), and cheese naan. Naan is the perfect accompaniment to curries, as its soft texture is ideal for scooping up rich gravies.",
    "region": "Punjab, North India, Central Asia",
    "type": "Bread",
    "dietary": ["Vegetarian", "Contains Gluten", "Contains Dairy"],
    "nutritional_highlights": "Good source of carbohydrates, protein from yogurt, B vitamins from flour",
    "preparation": "Leavened dough baked in tandoor at high heat, 2-3 minutes per bread"
  },
  {
    "id": "12",
    "text": "Tandoori Chicken is an iconic Punjabi dish featuring chicken pieces marinated in a mixture of yogurt, lemon juice, and a vibrant blend of spices including Kashmiri red chili (for color), garam masala, cumin, coriander, and ginger-garlic paste. The marinated chicken is traditionally cooked in a tandoor (clay oven) at extremely high temperatures, resulting in smoky, charred edges and juicy, flavorful meat. The dish gets its distinctive red-orange color from Kashmiri chili and sometimes food coloring. Served with mint chutney, onion rings, and lemon wedges.",
    "region": "Punjab, India",
    "type": "Main Course",
    "dietary": ["Gluten-Free", "High Protein", "Low Carb", "Keto-Friendly"],
    "nutritional_highlights": "Very high in lean protein, probiotics from yogurt marinade, low in carbs",
    "preparation": "Chicken marinated 4-24 hours, then grilled in tandoor or oven at high heat"
  },
  {
    "id": "13",
    "text": "Gulab Jamun is one of India's most beloved desserts, consisting of soft, golden-brown balls made from khoya (reduced milk solids) and a touch of flour, deep-fried until perfectly round, then soaked in warm rose-flavored sugar syrup (gulab means rose, jamun refers to a berry it resembles). The balls are incredibly soft and syrupy, melting in the mouth with each bite. Often garnished with chopped pistachios and served warm, gulab jamun is a must-have at weddings, festivals like Diwali, and celebrations throughout South Asia.",
    "region": "India, Pakistan, Nepal",
    "type": "Dessert",
    "dietary": ["Vegetarian", "Contains Gluten", "Contains Dairy"],
    "nutritional_highlights": "High in calcium from milk solids, moderate protein, energy-dense treat",
    "preparation": "Khoya balls deep-fried golden, soaked in cardamom-rose sugar syrup"
  },
  {
    "id": "14",
    "text": "Pav Bhaji is a popular Mumbai street food consisting of a thick, spicy vegetable mash (bhaji) made from potatoes, tomatoes, peas, bell peppers, and other vegetables, cooked with generous amounts of butter and a special pav bhaji masala spice blend. The bhaji is served with soft, buttered bread rolls (pav) that are toasted on a griddle until crispy on the outside. Garnished with raw onions, cilantro, lemon wedge, and extra butter, this dish originated in the textile mills of Mumbai as a quick, filling meal for workers.",
    "region": "Mumbai, Maharashtra, India",
    "type": "Snack",
    "dietary": ["Vegetarian", "Can be made Vegan"],
    "nutritional_highlights": "Rich in vegetables, vitamins, fiber, carbohydrates for energy",
    "preparation": "Mixed vegetables mashed and cooked with butter and spices, served with toasted rolls"
  },
  {
    "id": "15",
    "text": "Raita is a cooling yogurt-based condiment essential to Indian cuisine, designed to balance the heat of spicy dishes. Made by whisking fresh yogurt with additions like cucumber (boondi raita), onion, tomato, mint, or boondi (fried gram flour balls), and seasoned with roasted cumin, salt, and sometimes chaat masala. Raita aids digestion due to its probiotic content and provides a refreshing contrast to rich curries and biryanis. It's an excellent source of protein, calcium, and beneficial gut bacteria.",
    "region": "India, Pakistan",
    "type": "Condiment",
    "dietary": ["Vegetarian", "Gluten-Free", "Probiotic"],
    "nutritional_highlights": "High in probiotics, calcium, protein, aids digestion, cooling effect",
    "preparation": "Whisked yogurt mixed with vegetables and spices, served chilled"
  },
  {
    "id": "16",
    "text": "Dhokla is a soft and fluffy savory cake made from fermented rice and chickpea flour.",
    "region": "Gujarat",
    "type": "Snack"
  },
  {
    "id": "17",
    "text": "Butter chicken is a rich tomato gravy dish with tender pieces of marinated chicken.",
    "region": "Delhi",
    "type": "Main Course"
  },
  {
    "id": "18",
    "text": "Lassi is a cold yogurt drink blended with sugar, salt, or fruits like mango.",
    "region": "Punjab",
    "type": "Drink"
  }, 
   {
    "id": "19",
    "text": "Momo is a type of South Asian dumpling popular in Nepal, filled with meat or vegetables and served with spicy chutney.",
    "region": "Nepal",
    "type": "Snack"
  },
  {
    "id": "20",
    "text": "Sel roti is a traditional homemade, sweet, ring-shaped rice bread from Nepal.",
    "region": "Nepal",
    "type": "Dessert"
  },
  {
    "id": "21",
    "text": "Hilsa curry is a traditional Bengali dish made with hilsa fish and mustard gravy.",
    "region": "Bangladesh",
    "type": "Main Course"
  },
  {
    "id": "22",
    "text": "Bhuna khichuri is a spiced rice and lentil dish often served with beef curry in Bangladesh.",
    "region": "Bangladesh",
    "type": "Main Course"
  },
  {
    "id": "23",
    "text": "Nihari is a slow-cooked stew of beef or lamb, eaten as breakfast in Pakistan.",
    "region": "Pakistan",
    "type": "Main Course"
  },
  {
    "id": "24",
    "text": "Chicken Karahi is a spicy curry cooked in a wok-like pan called a karahi, popular in Pakistan.",
    "region": "Pakistan",
    "type": "Main Course"
  },
  {
    "id": "25",
    "text": "Pad Thai is a stir-fried noodle dish with shrimp, peanuts, and tamarind sauce, one of Thailand's national dishes.",
    "region": "Thailand",
    "type": "Main Course"
  },
  {
    "id": "26",
    "text": "Tom Yum is a hot and sour Thai soup made with shrimp, lemongrass, and lime juice.",
    "region": "Thailand",
    "type": "Soup"
  },
  {
    "id": "27",
    "text": "Pho is a Vietnamese noodle soup consisting of broth, rice noodles, herbs, and meat.",
    "region": "Vietnam",
    "type": "Soup"
  },
  {
    "id": "28",
    "text": "Nasi Goreng is Indonesian-style fried rice often cooked with kecap manis, garlic, shallots, and chili.",
    "region": "Indonesia",
    "type": "Main Course"
  },
  {
    "id": "29",
    "text": "Rendang is a spicy meat dish slow-cooked in coconut milk and spices, originating from Indonesia.",
    "region": "Indonesia",
    "type": "Main Course"
  },
  {
    "id": "30",
    "text": "Nasi lemak is Malaysia's national dish consisting of fragrant rice cooked in coconut milk, served with sambal, anchovies, and egg.",
    "region": "Malaysia",
    "type": "Main Course"
  },
  {
    "id": "31",
    "text": "Adobo is a Filipino dish made by marinating meat in vinegar, soy sauce, and garlic, then simmering it.",
    "region": "Philippines",
    "type": "Main Course"
  },
  {
    "id": "32",
    "text": "Halo-halo is a Filipino dessert made from crushed ice, evaporated milk, and mixed ingredients like sweet beans, fruits, and jellies.",
    "region": "Philippines",
    "type": "Dessert"
  }, 
    {
    "id": "33",
    "text": "Peking duck is a famous Beijing dish featuring crispy roasted duck served with pancakes, hoisin sauce, and scallions.",
    "region": "China",
    "type": "Main Course"
  },
  {
    "id": "34",
    "text": "Kung Pao chicken is a spicy stir-fry dish made with chicken, peanuts, vegetables, and chili peppers.",
    "region": "China",
    "type": "Main Course"
  },
  {
    "id": "35",
    "text": "Mapo tofu is a Sichuan dish featuring soft tofu in a spicy chili and bean-based sauce, typically with minced pork.",
    "region": "Sichuan, China",
    "type": "Main Course"
  },
  {
    "id": "36",
    "text": "Xiao long bao are Chinese soup dumplings filled with meat and hot broth, typically served in a bamboo steamer.",
    "region": "Shanghai",
    "type": "Snack"
  },
  {
    "id": "37",
    "text": "Chow mein is a stir-fried noodle dish made with vegetables and sometimes meat or seafood.",
    "region": "China",
    "type": "Noodle"
  },
  {
    "id": "38",
    "text": "Hot and sour soup is a Chinese soup made with mushrooms, tofu, bamboo shoots, and egg, flavored with vinegar and white pepper.",
    "region": "China",
    "type": "Soup"
  },
  {
    "id": "39",
    "text": "Dim sum refers to a variety of small Chinese dishes served with tea, including dumplings, buns, and rolls.",
    "region": "Cantonese, China",
    "type": "Snack"
  },
  {
    "id": "40",
    "text": "Mooncake is a traditional Chinese pastry filled with lotus seed paste or red bean, eaten during the Mid-Autumn Festival.",
    "region": "China",
    "type": "Dessert"
  }, 
  {
  "id": "41",
  "text": "Kimchi is a traditional Korean side dish made from fermented vegetables, usually cabbage and radish, with chili pepper and garlic.",
  "region": "Korea",
  "type": "Side Dish"
},
{
  "id": "42",
  "text": "Bibimbap is a Korean mixed rice dish topped with sautéed vegetables, sliced meat, a fried egg, and chili paste.",
  "region": "Korea",
  "type": "Main Course"
},
{
  "id": "43",
  "text": "Tteokbokki is a popular Korean street food made of chewy rice cakes in a spicy red sauce.",
  "region": "Korea",
  "type": "Snack"
}, 
{
  "id": "44",
  "text": "Beef noodle soup is a beloved Taiwanese dish made with braised beef, vegetables, and noodles in a flavorful broth.",
  "region": "Taiwan",
  "type": "Soup"
},
{
  "id": "45",
  "text": "Lu rou fan is a classic Taiwanese comfort food of minced pork belly cooked in soy sauce, served over rice.",
  "region": "Taiwan",
  "type": "Main Course"
},
{
  "id": "46",
  "text": "Bubble tea is a Taiwanese drink made with tea, milk, and chewy tapioca pearls.",
  "region": "Taiwan",
  "type": "Drink"
}, 
{
  "id": "47",
  "text": "Char siu is a Cantonese-style barbecued pork known for its sweet and savory glaze.",
  "region": "Hong Kong",
  "type": "Main Course"
},
{
  "id": "48",
  "text": "Egg tarts are a popular Hong Kong dessert consisting of a flaky pastry crust filled with egg custard.",
  "region": "Hong Kong",
  "type": "Dessert"
},
{
  "id": "49",
  "text": "Wonton noodles are a Hong Kong dish made with thin egg noodles and wontons in a clear broth.",
  "region": "Hong Kong",
  "type": "Noodle"
}, 
{
  "id": "50",
  "text": "Meat pie is an iconic Australian dish consisting of a flaky pastry filled with minced meat and gravy.",
  "region": "Australia",
  "type": "Snack"
},
{
  "id": "51",
  "text": "Lamingtons are sponge cakes coated in chocolate and rolled in coconut, a popular Australian dessert.",
  "region": "Australia",
  "type": "Dessert"
} ,
{
  "id": "52",
  "text": "Pavlova is a meringue-based dessert topped with fresh fruit and cream, considered a national dish of New Zealand.",
  "region": "New Zealand",
  "type": "Dessert"
},
{
  "id": "53",
  "text": "Hangi is a traditional Māori method of cooking meat and vegetables in an underground oven.",
  "region": "New Zealand",
  "type": "Main Course"
},
{
  "id": "54",
  "text": "Palusami is a Polynesian dish of taro leaves filled with coconut cream and sometimes meat, baked in banana leaves.",
  "region": "Samoa, South Pacific",
  "type": "Main Course"
},
{
  "id": "55",
  "text": "Oka is a Samoan raw fish salad marinated in citrus and coconut milk, similar to ceviche.",
  "region": "Samoa, South Pacific",
  "type": "Appetizer"
},
{
  "id": "56",
  "text": "Lovo is a Fijian feast where food is wrapped in banana leaves and cooked in an earth oven.",
  "region": "Fiji, South Pacific",
  "type": "Main Course"
}
,
{
  "id": "57",
  "text": "Kokoda is a Fijian dish of raw fish marinated in lime juice and coconut milk, similar to ceviche.",
  "region": "Fiji, South Pacific",
  "type": "Appetizer"
},
{
  "id": "58",
  "text": "Poke is a Hawaiian dish of diced raw fish, typically seasoned with soy sauce and sesame oil.",
  "region": "Hawaii, USA",
  "type": "Appetizer"
},
{
  "id": "59",
  "text": "Spam musubi is a Hawaiian snack made of rice and Spam wrapped in seaweed.",
  "region": "Hawaii, USA",
  "type": "Snack"
},
{  "id": "60",
  "text": "Loco moco is a Hawaiian dish consisting of rice topped with a hamburger patty, fried egg, and brown gravy.",
  "region": "Hawaii, USA",
  "type": "Main Course"
},
{
  "id": "61",
  "text": "Sushi is a Japanese dish of vinegared rice combined with seafood, vegetables, and sometimes tropical fruits.",
  "region": "Japan",
  "type": "Main Course"
},
{
  "id": "62",
  "text": "Ramen is a Japanese noodle soup dish with Chinese-style wheat noodles served in a meat or fish-based broth.",
  "region": "Japan",
  "type": "Main Course"
},
{
  "id": "63",
  "text": "Tempura is a Japanese dish of seafood or vegetables that have been battered and deep-fried.",
  "region": "Japan",
  "type": "Main Course"
},
{
  "id": "64",
  "text": "Miso soup is a traditional Japanese soup consisting of a stock called dashi into which softened miso paste is mixed.",
  "region": "Japan",
  "type": "Soup"
},
{
  "id": "65",
  "text": "Okonomiyaki is a savory Japanese pancake containing a variety of ingredients.",
  "region": "Japan",
  "type": "Main Course"
},
{
  "id": "66",
  "text": "Hummus is a Middle Eastern dip or spread made from cooked, mashed chickpeas blended with tahini, olive oil, lemon juice, and garlic.",
  "region": "Middle East",
  "type": "Appetizer"
},
{
  "id": "67",
  "text": "Falafel consists of deep-fried balls of ground chickpeas or fava beans, typically served in pita bread.",
  "region": "Middle East",
  "type": "Main Course"
},
{
  "id": "68",
  "text": "Shawarma is a Middle Eastern meat preparation where thin slices of lamb, chicken, or beef are stacked and roasted on a vertical rotisserie.",
  "region": "Middle East",
  "type": "Main Course"
},
{
  "id": "69",
  "text": "Tabbouleh is a Levantine vegetarian salad made of finely chopped parsley, tomatoes, mint, and bulgur.",
  "region": "Middle East",
  "type": "Salad"
},
{
  "id": "70",
  "text": "Baklava is a rich, sweet dessert pastry made of layers of filo filled with chopped nuts and sweetened with syrup or honey.",
  "region": "Middle East",
  "type": "Dessert"
},
{
  "id": "71",
  "text": "Buuz are Mongolian steamed dumplings filled with minced meat, typically mutton or beef.",
  "region": "Mongolia",
  "type": "Main Course"
},
{
  "id": "72",
  "text": "Khorkhog is a Mongolian barbecue dish where meat is cooked with hot stones inside a sealed container.",
  "region": "Mongolia",
  "type": "Main Course"
},
{
  "id": "73",
  "text": "Airag is a traditional Mongolian alcoholic drink made from fermented mare's milk.",
  "region": "Mongolia",
  "type": "Beverage"
},
{
  "id": "74",
  "text": "Boortsog are Mongolian deep-fried cookies often served with tea or used as a dessert.",
  "region": "Mongolia",
  "type": "Dessert"
},
{
  "id": "75",
  "text": "Suutei tsai is a traditional Mongolian milk tea made with green tea, milk, water, and salt.",
  "region": "Mongolia",
  "type": "Beverage"
}
]
